In [1]:
import pandas as pd

In [2]:
s = pd.Series(['pizza', 42])

In [3]:
s

0    pizza
1       42
dtype: object

In [4]:
s = pd.Series(['pizza', 42], index=['food', 'number'])

In [5]:
s

food      pizza
number       42
dtype: object

In [6]:
s.loc['food']

'pizza'

In [7]:
s.loc['number']

42

In [8]:
s.iloc[0]

'pizza'

In [9]:
scientists = pd.DataFrame({
    'Name': ['Franklin', 'Gosset'],
    'job': ['chem', 'stats']
})

In [10]:
scientists

       Name    job
0  Franklin   chem
1    Gosset  stats

In [11]:
scientists = pd.DataFrame({
    'Name': ['Franklin', 'Gosset'],
    'job': ['chem', 'stats']},
    index=['a', 'b'],
    columns=['job', 'Name']

)

In [12]:
scientists

     job      Name
a   chem  Franklin
b  stats    Gosset

In [13]:
scientists = pd.read_csv('../data/scientists.csv')

In [14]:
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [15]:
type(scientists['Age'])

pandas.core.series.Series

In [16]:
scientists['Age'].describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [18]:
scientists['Age'] + scientists['Age']

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [19]:
scientists['Age'] * 2

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [20]:
scientists['age_doubled'] = scientists['Age'] * 2

In [21]:
scientists

,Name,Born,Died,Age,Occupation,age_doubled
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,74
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,122
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,180
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,132
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,112
5,John Snow,1813-03-15,1858-06-16,45,Physician,90
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,82
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,154